//=====================================================================
//文件名称：isr.c（中断处理程序源文件）
//框架提供：苏大arm技术中心(sumcu.suda.edu.cn)
//版本更新：2017.01：1.0；2019.02：A.12
//功能描述：提供中断处理程序编程框架
//=====================================================================
#include "includes.h"

//======================================================================
//程序名称：GPIOA组输入引脚中断处理程序
//触发条件：GPIOA引脚开关量输入变化触发，至于是何种变化触发，由初始化确定
//备    注：进入后，可使用gpio_get_int函数判断哪个引脚触发的中断
//         （1-引脚有GPIO中断，0-引脚无GPIO中断）
//======================================================================
void GPIOA_Handler(void)
{
	DISABLE_INTERRUPTS;     //关总中断
	//------------------------------------------------------------------
	//（在此处增加功能）

	//------------------------------------------------------------------
	ENABLE_INTERRUPTS;     //关总中断
}

//======================================================================
//程序名称：GPIOB组输入引脚中断处理程序
//触发条件：GPIOB引脚开关量输入变化触发，至于是何种变化触发，由初始化确定
//备    注：进入后，可使用gpio_get_int函数判断哪个引脚触发的中断
//         （1-引脚有GPIO中断，0-引脚无GPIO中断）
//======================================================================
void GPIOB_Handler(void)
{
	DISABLE_INTERRUPTS;     //关总中断
	//------------------------------------------------------------------
	//（在此处增加功能）

	//------------------------------------------------------------------
	ENABLE_INTERRUPTS;     //关总中断
}

//======================================================================
//程序名称：UARTA接收中断处理程序
//触发条件：UARTA收到一个字节触发
//备    注：进入本程序后，可使用uart_get_re_int函数可再进行中断标志判断
//          （1-有UART接收中断，0-没有UART接收中断）
//======================================================================
void UARTA_Handler(void)
{

	uint_8 ch;
	uint_8 flag;

	DISABLE_INTERRUPTS;      //关总中断
	//------------------------------------------------------------------
	//接收一个字节
	ch = uart_re1(UART_USER, &flag);   //调用接收一个字节的函数，清接收中断位
	if(flag)   //有数据
	{
		uart_send1(UART_USER,ch);//回发接收到的字节
	}
	//------------------------------------------------------------------
	ENABLE_INTERRUPTS;       //开总中断
}


//======================================================================
//程序名称：SPIA接收中断处理程序
//触发条件：SPIA收到数据触发
//======================================================================
void SPIA_Handler(void)
{
	DISABLE_INTERRUPTS;     //关总中断
	//------------------------------------------------------------------
	//（在此处增加功能）

	//------------------------------------------------------------------
	ENABLE_INTERRUPTS;     //关总中断
}

//======================================================================
//程序名称：SPIA接收中断处理程序
//触发条件：SPIA收到数据触发
//======================================================================
void SPIB_Handler(void)
{
	DISABLE_INTERRUPTS;     //关总中断
	//------------------------------------------------------------------
	//（在此处增加功能）

	//------------------------------------------------------------------
	ENABLE_INTERRUPTS;     //关总中断
}

//======================================================================
//程序名称：I2CA接收中断处理程序
//触发条件：I2CA收到数据触发
//======================================================================
void I2CA_Handler(void)
{
	DISABLE_INTERRUPTS;     //关总中断
	//------------------------------------------------------------------
	//（在此处增加功能）

	//------------------------------------------------------------------
	ENABLE_INTERRUPTS;     //关总中断
}


//======================================================================
//程序名称：I2C1接收中断处理程序
//触发条件：I2CB收到数据触发
//======================================================================
void I2CB_Handler(void)
{
	DISABLE_INTERRUPTS;     //关总中断
	//------------------------------------------------------------------
	//（在此处增加功能）

	//------------------------------------------------------------------
	ENABLE_INTERRUPTS;     //关总中断
}



//======================================================================
//程序名称：TSI中断处理程序
//触发条件：TSI通道超值中断，可设置其触发阈值的上下限，当TSI通道计数器超出
//         阈值范围时触发此中断
//======================================================================
void TSI_Handler(void)
{
	//存放数值的临时变量
	uint_16 i;
	uint_8 touchNum[10];
	DISABLE_INTERRUPTS;                        //关总中断
	//------------------------------------------------------------------
	//（在此处增加功能）
	if(tsi_get_int(TSI_TOUCH))     //若为TSI超值中断
	{
											   //获取计数值
		i = tsi_get_value(TSI_TOUCH);//读取计数寄存器中的值;
		if(i>500)                              //判断是否为一次有效触摸
		{
			gUserData.touchNum++;
			LCD_ShowString(36,189,BLUE,GRAY,   //LCD上显示TSI触摸次数
					(uint_8 *)IntConvertToStr(gUserData.touchNum,touchNum));
		}
	}
	tsi_clear_int(TSI_TOUCH);
	//------------------------------------------------------------------
	ENABLE_INTERRUPTS;                        //开总中断
}

//======================================================================
//程序名称：输入捕捉（TPM0)中断处理程序
//触发条件：TPM0模块的通道引脚捕捉到初始化时设定的电平变化信号时触发（输入捕捉）
//======================================================================
void INCAP_Handler(void)
{
	DISABLE_INTERRUPTS;     //关总中断
	//------------------------------------------------------------------
	//（在此处增加功能）

	//------------------------------------------------------------------
	ENABLE_INTERRUPTS;     //关总中断
}

//======================================================================
//程序名称：TIMERA_Handler（TIMERA模块中断处理程序）
//触发条件：定时器计时达到初始化时设置的计时间隔时，触发定时器溢出中断
//======================================================================
void TIMERA_Handler(void)
{
	DISABLE_INTERRUPTS;                       //关总中断
	//------------------------------------------------------------------
	//（在此处增加功能）
	timer_clear_int(TIMER_LP);                //清中断标志
	tsi_search(TSI_TOUCH);                             //触发一次TSI扫描
	//------------------------------------------------------------------
    ENABLE_INTERRUPTS;                        //开总中断
}

//======================================================================
//程序名称：TIMERB_Handler（TIMERB模块中断处理程序）
//触发条件：定时器计时达到初始化时设置的计时间隔时，触发定时器溢出中断
//======================================================================
void TIMERB_Handler(void)
{
	DISABLE_INTERRUPTS;                        //关总中断
	//------------------------------------------------------------------
	//（在此处增加功能）

	//------------------------------------------------------------------
	ENABLE_INTERRUPTS;                        //开总中断
}


//======================================================================
//程序名称：TIMERC_Handler（TIMERC模块中断处理程序）
//触发条件：定时器计时达到初始化时设置的计时间隔时，触发定时器溢出中断
//======================================================================
void TIMERC_Handler(void)
{
	DISABLE_INTERRUPTS;                        //关总中断
	//------------------------------------------------------------------
	//（在此处增加功能）

	//------------------------------------------------------------------
	ENABLE_INTERRUPTS;                        //开总中断
}
